-- liquibase formatted sql

--changeset Alex:03

INSERT INTO passenger (id, first_name, last_name, patronymic, passport_series, passport_number) OVERRIDING SYSTEM VALUE VALUES
    (1, 'Иван', 'Иванов', 'Иванович', '4510', '123456'),
    (2, 'Мария', 'Петрова', 'Сергеевна', '4511', '234567'),
    (3, 'Алексей', 'Сидоров', 'Андреевич', '4512', '345678'),
    (4, 'Елена', 'Козлова', 'Дмитриевна', '4513', '456789'),
    (5, 'Дмитрий', 'Новиков', 'Павлович', '4514', '567890'),
    (6, 'Анна', 'Морозова', 'Викторовна', '4515', '678901'),
    (7, 'Сергей', 'Волков', 'Николаевич', '4516', '789012'),
    (8, 'Ольга', 'Соколова', 'Алексеевна', '4517', '890123'),
    (9, 'Николай', 'Лебедев', 'Олегович', '4518', '901234'),
    (10, 'Татьяна', 'Кузнецова', 'Игоревна', '4519', '012345'),
    (11, 'Павел', 'Орлов', 'Михайлович', '4520', '112233'),
    (12, 'Юлия', 'Фёдорова', 'Александровна', '4521', '223344'),
    (13, 'Артём', 'Макаров', 'Романович', '4522', '334455'),
    (14, 'Виктория', 'Зайцева', 'Евгеньевна', '4523', '445566'),
    (15, 'Константин', 'Смирнов', 'Владимирович', '4524', '556677'),
    (16, 'Наталья', 'Васильева', 'Петровна', '4525', '667788'),
    (17, 'Максим', 'Попов', 'Сергеевич', '4526', '778899'),
    (18, 'Екатерина', 'Филиппова', 'Андреевна', '4527', '889900'),
    (19, 'Роман', 'Комаров', 'Денисович', '4528', '990011'),
    (20, 'Светлана', 'Белова', 'Олеговна', '4529', '101112');

SELECT setval(pg_get_serial_sequence('passenger', 'id'), (SELECT MAX(id) FROM passenger));
